{
  "projects": [
    {
      "title": "NASA/ASU L'SPACE Program",
      "year": "2024",
      "description": "Lead the science development of critical mission milestones including MDR, MCR, PDR, and SRR papers. Lead scientific theoretical research on Mars rover instrumentation and command data handling concept, specializing in science instrumentation. Proficient in teaming, requirements analysis, project management, system engineering in aerospace, risk management for mission success, and expertise in heat transfer/thermal dynamics and Siemens NX software all tailored to NASA's standard."
    },
    {
      "title": "NASA MUREP MINDS",
      "year": "2023-2024",
      "description": "Lead 'Science and Technology Applications for Research in Space' at home institution, a private 10- student, 3-faculty research team for NASA’s Artemis mission. Conceptualized fixed LIDAR data collection device to employ at a lunar south pole location for slope computation, elevation modeling, and autonomous vehicle training, emphasizing field-of-view perspective data. Secured $1,500 in funding from NASA to support research initiative following a research proposal. Second place Technical Paper Award.",
      "source": "https://github.com/STARS-Dominican-University"
    },
    {
      "title": "Nasa JPL Scraper",
      "year": "2023",
      "description": "This Python script scrapes images from the NASA Jet Propulsion Laboratory (JPL) website using BeautifulSoup4 (bs4) library.",
      "source": "https://github.com/bedolpab/NASA-JPL-Scraper.git"
    },
    {
      "title": "Lapses",
      "year": "2023",
      "description": "DCGAN to generate synthetic images to destroy the model to represent loss of cognitive function (Dementia). Collaborated with Neuroscience Professor & other esteemed faculty members at my university to apply ML techniques to scientifically construct and accurately represent the project and optimize the model. Utilized Python, Keras, scikit-image, TensorFlow, and NumPy. Developed web scraper for the training dataset.",
      "source": "https://github.com/bedolpab/Lapses.git"
    },
    {
      "title": "CourseRank",
      "year": "2023",
      "description": "Implemented custom BM25 ranking algorithm in Python using Pandas, NumPy, and Jupyter Notebook. Optimized to rank courses at Dominican University based on description relevancy given query.",
      "source": "https://github.com/bedolpab/CourseRank.git"
    },
    {
      "title": "FBI Wanted Analysis",
      "year": "2023",
      "description": "Used FBI's API to apply SNA & Clustering in Python to uncover patterns in criminal activity. Data cleaning and processing to analyze data using Pandas, NumPy, NetworkX.",
      "source": "https://github.com/bedolpab/FBI-Wanted-Analysis"
    },
    {
      "title": "UA Safety (Contributor)",
      "year": "2022",
      "description": "A global website containing vital information for Ukrainian refugees. Implemented and updated website translations using JavaScript along with minor refactoring in the backend. Documented border and refugee information for other developers to reference.",
      "source": "https://github.com/Ukraine-Relief-Efforts/ukraine-info-guide"
    },
    {
      "title": "Ternel",
      "year": "2022",
      "description": "A collection library of solutions and approaches to algorithmic and mathematical problems written in C# and Java.",
      "source": "https://github.com/bedolpab/Ternel"
    },
    {
      "title": "WPF Interactive Game",
      "year": "2022",
      "description": "UI oriented game designed and implemented in WPF using C#. Designed 2D elements using Figma. Highlight consists of an installation and removal of inventory elements to be dynamically handled.",
      "source": "https://github.com/bedolpab/TheWoodlands"
    },
    {
      "title": "Pixel Manipulation",
      "year": "2022",
      "description": "Pixel manipulation application in Python using Pillow. Utilizes a single versatile function that manipulates RGB values in an image.",
      "source": "https://github.com/bedolpab/Image-Filter"
    }
  ]
}